<script lang="ts">
	import { twJoin } from 'tailwind-merge';

	import { CheckBox } from '$lib/components/forms';
	import { consent, verify } from '$lib/stores/consent';

	const policies = [
		{
			name: 'ข้อมูลสำคัญเกี่ยวกับโครงการ',
			detail: '',
			lists: [
				'โครงการแข่งขันแก้ไขปัญหาด้วยการเขียนโปรแกรมคอมพิวเตอร์ระดับมัธยมศึกษาตอนปลายปี การศึกษา 2566 หรือ <span class="font-serif">BangMod Hackathon 2024</span> ซึ่งต่อจากนี้จะเรียกว่า "โครงการ" ดําเนินการ โดยคณะทํางานโครงการ ซึ่งต่อจากนี้จะเรียกว่า "คณะทํางาน"',
				'คณะทํางานเป็นผู้ให้บริการเว็บไซต์ <span class="font-serif">bangmodhackathon.com</span> และเว็บไซต์ที่เกี่ยวข้องซึ่งต่อจากนี้ จะเรียกรวมว่า "เว็บไซต์"',
				'ผู้ใช้งานเว็บไซต์ซึ่งต่อจากนี้จะเรียกว่า "ท่าน" หรือ "คุณ" เป็นบุคคลหรือผู้แทนที่มีสิทธิในการให้ความยินยอมในการเก็บรวบรวมใช้ และเปิดเผยข้อมูลส่วนบุคคลทั้งหมดของตน',
				'เนื่องด้วยโครงการได้เห็นความสําคัญของการรักษาข้อมูลส่วนบุคคลของผู้ใช้งานจึงได้กําหนดนโยบาย ความเป็นส่วนตัวนี้ขึ้น เพื่อกําหนดความมุ่งมั่นของโครงการต่อความเป็นส่วนตัวของผู้ใช้งาน รวมถึง ชี้แจงให้ทราบเกี่ยวกับกระบวนวิธีการ การเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลในโครงการ ดังนั้น กรุณาอ่านนโยบายความเป็นส่วนตัวนี้โดยละเอียด โดยเมื่อเข้าใช้งานเว็บไซต์ของโครงการ และยอมรับนโยบายที่เกี่ยวข้องนี้อย่างชัดเจน จะถือว่าท่านรับทราบ และยอมรับข้อกําหนดนโยบายข้อมูลส่วนบุคคลนี้แล้ว หากท่านไม่ยอมรับนโยบายข้อมูลส่วนบุคคล ท่านจะไม่สามารถทําการสมัครผ่านเว็บไซต์ของโครงการได้'
			]
		},
		{
			name: 'ข้อมูลส่วนบุคคล',
			detail:
				'ข้อมูลส่วนบุคคล หรือข้อความส่วนบุคคลที่ทางโครงการเก็บรวบรวมเกี่ยวกับผู้ใช้ จะเป็นข้อมูลที่สามารถระบุตัวตนของท่านได้ ทางโครงการจะทําการเก็บรวบรวม ถ่ายโอน และใช้ข้อมูลส่วนบุคคลประเภทต่าง ๆ ที่เกี่ยวกับผู้ใช้ตามที่โครงการได้จัดกลุ่มไว้ด้วยกัน ดังต่อไปนี้',
			lists: [
				'ข้อมูลส่วนตัว ได้แก่ ชื่อ-นามสกุล ชื่อเล่น เบอร์โทรศัพท์ รูปถ่าย สําเนาบัตรประชาชนของท่าน ช่องทางการติดต่อ หนังสือยืนยันสถานภาพเป็นอาจารย์ประจําสถาบันการศึกษา และอีเมลเพื่อใช้สําหรับการติดต่อ รวมไปถึงอาหาร ยาที่แพ้ และโรคประจําตัว',
				'ข้อมูลการศึกษา ได้แก่ ใบรับรองผลการศึกษา (ปพ.7) ระดับการศึกษา หลักสูตร ชื่อสถานศึกษา'
			]
		},
		{
			name: 'วิธีการเก็บรวบรวมข้อมูลผู้ใช้ของโครงการ',
			detail:
				'โครงการอาจเก็บรวบรวมข้อมูลเกี่ยวกับผู้ใช้หลายวิธี เช่น การเก็บข้อมูลปฏิสัมพันธ์โดยตรง การกรอกแบบฟอร์มบนเว็บไซต์รับสมัครของโครงการ เพื่อทําการสมัครเข้าร่วมโครงการ เป็นต้น',
			lists: [
				'เทคโนโลยีอัตโนมัติ หรือปฏิสัมพันธ์ในขณะที่ท่านโต้ตอบกับเว็บไซต์ของโครงการ เช่น ข้อมูลเกี่ยวกับเบราว์เซอร์ของท่าน หรือลิงก์ที่ท่านรับชมเนื้อหาบนเว็บไซต์ของโครงการ เป็นต้น โดยทั้งหมดนี้จะช่วยให้โครงการสามารถส่งมอบประสบการณ์ที่ดีแก่ท่านเมื่อท่านเข้าชมเว็บไซต์ของโครงการ และยังช่วยให้โครงการสามารถปรับปรุงพัฒนาเว็บไซต์ให้ดียิ่งขึ้น',
				'บุคคลที่สาม หรือแหล่งข้อมูลสาธารณะ โครงการจะเก็บข้อมูลของผู้ใช้ผ่านการเข้าสู่ระบบโดยใช้สื่อสังคมออนไลน์ ทําให้โครงการอาจเก็บรวบรวมข้อมูลการติดต่อ อัตลักษณ์ และข้อมูลทางเทคนิค รวมไปถึง ชื่อผู้ใช้งาน รูปประจําตัวผู้ใช้งาน และอีเมล ข้อมูลเกี่ยวกับสื่อสังคมออนไลน์ที่ท่านยินยอมเปิดเผยกับโครงการจะไปรวมกับข้อมูลที่ผู้ใช้ให้กับโครงการไว้ หรือที่โครงการรวบรวมไว้เกี่ยวกับท่าน'
			]
		},
		{
			name: 'วัตถุประสงค์ของการใช้ข้อมูลส่วนบุคคล',
			detail: 'โครงการมีวัตถุประสงค์ในการใช้ข้อมูล ดังต่อไปนี้',
			lists: [
				'โครงการใช้ข้อมูลส่วนบุคคลเพื่อยืนยันคุณสมบัติ และคัดเลือกผู้เข้าร่วมโครงการ',
				'โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดกิจกรรมในโครงการ',
				'โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดทําใบประกาศนียบัตรสําหรับผู้ที่เข้าร่วมโครงการ',
				'โครงการใช้ข้อมูลส่วนบุคคลเพื่อให้สามารถติดต่อผู้ดูแลได้ในกรณีฉุกเฉิน',
				'โครงการใช้ข้อมูลแบบไม่ระบุตัวตนและข้อมูลเทคโนโลยีอัตโนมัติเพื่อใช้ในการวิเคราะห์ข้อมูลทางสถิติ'
			]
		},
		{
			name: 'ระยะเวลาในการเก็บข้อมูลส่วนบุคคล',
			detail:
				'โครงการจะเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จําเป็นในการจัดโครงการครั้งปัจจุบัน และสําหรับโครงการครั้งถัดไป โดยมีระยะเวลาการจัดเก็บข้อมูลไว้ไม่เกิน 4 ปี',
			lists: []
		},
		{
			name: 'สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล',
			detail:
				'ท่านสามารถใช้สิทธิที่ท่านมีอยู่ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล อันรวมถึงการเข้าถึง การแก้ไข การลบ และระงับการประมวลผลข้อมูลส่วนบุคคลได้ โดยติดต่อผ่านทางผู้ดูแลข้อมูลของโครงการ ได้ที่อีเมล <span class="sm:text-md font-serif text-sm"> phimchanok.trex@mail.kmutt.ac.th </span>',
			lists: []
		}
	];
</script>

<svelte:head>
	<title>Privacy Policy</title>
</svelte:head>

<div
	class="text-md border-asphalt text-asphalt relative mx-auto mb-12 mt-12 w-[95%] max-w-screen-lg border text-sm md:mt-20"
>
	<h1
		class="bg-white font-decorate absolute left-1/2 top-0 w-fit -translate-x-1/2 -translate-y-1/2 px-4 text-center text-4xl tracking-tight md:px-8 md:text-5xl"
	>
		Privacy Policies
	</h1>
	<div class="mt-16 flex flex-col gap-8 px-12 md:gap-12 md:px-6">
		{#each policies as policy}
			<div class="flex w-full flex-col gap-4 md:flex-row">
				<h2 class="text-center text-xl font-medium md:basis-3/5 md:text-left lg:text-lg">
					{policy.name}
				</h2>
				<div class="w-full font-light md:col-span-3">
					{#if policy.detail.length}
						<p class={twJoin('pl-4', policy.lists.length ? 'mb-4' : '')}>
							<!--	eslint-disable-next-line svelte/no-at-html-tags -->
							{@html policy.detail}
						</p>
					{/if}
					<ol class="list-outside list-decimal space-y-2">
						{#each policy.lists as item}
							<li class="pl-4">
								<!--	eslint-disable-next-line svelte/no-at-html-tags -->
								{@html item}
							</li>
						{/each}
					</ol>
				</div>
			</div>
			<hr class="border" />
		{/each}
		<form action="/register">
			<fieldset class="m-4 mx-auto mb-8 w-3/4 space-y-5">
				<div class="flex w-full flex-col gap-2 font-light md:flex-row">
					<CheckBox name='consent' bind:checked={$consent} required>
						ข้าพเจ้าได้อ่านเงื่อนไขและข้อกำหนดอย่างครบถ้วนแล้ว และยอมรับในเงื่อนไขและข้อกำหนดทั้งหมด
					</CheckBox>
					<CheckBox name='verify' class="lg:col-span-2" bind:checked={$verify} required>
						ข้าพเจ้าขอยืนยันว่าข้อมูลที่ใช้ในการสมัครเป็นข้อมูลจริง
					</CheckBox>
				</div>

				<button
					type="submit"
					disabled={!$verify || !$consent}
					class="border-azul-600 text-azul-600 enabled:hover:bg-azul-600 enabled:hover:text-white disabled:border-iron-300 disabled:text-iron-300 mx-auto flex h-12 w-64 items-center justify-center rounded-full border"
				>
					ดำเนินการต่อ
				</button>
			</fieldset>
		</form>
	</div>
</div>
